Revit 2027 API
PlasticVinyl.PlasticvinylColorByObject Property
 The property labeled "Color By Object" from the "PlasticVinyl" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static string PlasticvinylColorByObject { get; }
Public Shared ReadOnly Property PlasticvinylColorByObject As String
	Get
public:
static property String^ PlasticvinylColorByObject {
	String^ get ();
}
static member PlasticvinylColorByObject : string with get
Property Value
String
Remarks
 This property is of type "AssetPropertyBoolean".
See Also
Reference
PlasticVinyl Class
Autodesk.Revit.DB.Visual Namespace